[
  {
    "title": "Rent-A-Rat",
    "image": "./images/rat.svg",
    "description": "Rent-a-Rat är en Vue.js-applikation för att hyra och hyra ut råttor och deras tjänster, med en dynamisk användarupplevelse. Den har två huvudlayouter—Rentee och Renter—som låter användare bläddra, boka och hantera råttuthyrningar. ",
    "details": " Funktioner inkluderar autentisering, användarprofiler, råttsökning, favoriter och redigering, tillsammans med engagerande UI-effekter som partiklar och glödande knappar. Byggd med Vue 3 och Vue Router 4, är appen modulär och lätt att underhålla, med återanvändbara komponenter och smidig navigering. En rolig och interaktiv plattform för att utforska modern webbutveckling med ett fantasifullt",
    "link": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "modalTitle": "Rent-a-Rat",
    "gitHubLink": "https://github.com/TeamMalmo/RentRat/tree/dev",
    "alt": "Rat Logo",
    "course": "Vue - Gruppprojekt",
    "tech": "Vue, Vite, Axios, Oauth JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },
  {
    "title": "King Pizza-rd and the Lizard Wizard",
    "image": "./images/pizza.png",
    "description": "Detta projekt är en magisk och interaktiv webbplats för pizzerian King Pizzard och Lizzard Wizzard. Webbplatsen är byggd med Vue 3 och använder Vite som byggverktyg. Här kan användare läsa den fantasifulla berättelsen om Pizzard, en pizzatillverkande trollkarl, och utforska pizzerians magiska meny.",
    "details": "Webbplatsen erbjuder en dynamisk meny som hämtas från ett externt API, samt en interaktiv kundvagn där användare kan lägga till och ta bort pizzor. All information om kundvagnen sparas lokalt i webbläsarens localStorage för att säkerställa att innehållet bevaras även vid siduppdatering.Projektet kombinerar kreativt berättande med funktionell webbapplikation och ger en engagerande upplevelse för användaren.",
    "link": "https://github.com/evesteve94/PizzaSite",
    "modalTitle": "King Pizza-rd and the Lizard Wizard",
    "gitHubLink": "https://github.com/evesteve94/PizzaSite",
    "alt": "Pizza Logo",
    "course": "Vue",
    "tech": "Vue, Vite, JavaScript, HTML, CSS",
    "date": "Dec 2024"
  },
  {
    "title": "The Journalists Guide to Inaccuracy",
    "image": "./images/journalist.png",
    "description": "The Journalist's Guide To Inaccuracy är en rolig och interaktiv webbsida där kreativitet och humor står i fokus. Plattformen använder AI för att skapa kvicka och absurda artiklar som berättas av ikoniska karaktärer som Marvin the Paranoid Android, Arthur Dent och Zaphod Beeblebrox. Användare kan anpassa upplevelsen genom att välja ämnen, målgrupper och berättare, samtidigt som de får ta del av anpassade AI-genererade bilder. Det är en lekfull utforskning av berättande där sanningen sätts på paus och fantasin styr. Webbappen är byggd med moderna teknologier som React, TypeScript och Node.js för en smidig användarupplevelse. ",
    "details": "Plattformen är byggd med en modern teknisk stack för att erbjuda både snabbhet och flexibilitet. Frontend är utvecklad med React och TypeScript, vilket ger en dynamisk och typad användarupplevelse, medan Vite används för snabb utveckling och build-processer. För att möjliggöra smidig navigering mellan olika sidor används React Router, och API-anrop hanteras av Axios. Backend är byggd på Node.js och Express.js, där Prisma används som ORM för att hantera PostgreSQL-databasen. För att generera artiklar och bilder används OpenAI och en AI SDK, medan bilder lagras och hämtas via Cloudinary. Filuppladdningar hanteras av Multer, vilket säkerställer att användarna får en sömlös upplevelse i hela applikationen.",
    "link": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "modalTitle": "The Journalists Guide to Inaccuracy",
    "gitHubLink": "https://github.com/evesteve94/journalists-guide-to-inaccuracy/tree/main",
    "alt": "Website Logo",
    "course": "AI i webbutveckling",
    "tech": "Node, Express, React, TypeScript, Prisma, Multer, Cloudinary, OpenAI",
    "date": "Nov 2024"
  },
  {
    "title": "Bröllopssida",
    "image": "./images/jellyfish.png",
    "description": "Den här webbplatsen är överlägset mitt favorit sidoprojekt hittills. Det är en bröllopspresent till min bror som implementerar hans blivande frus illustrationer. Det är mitt största React-projekt, med massor av skräddarsydda komponenter och sömlösa dropdown-menyer Dessutom har jag implementerat inloggning, autentisering och en databas genom Firebase db. Användare kan logga in, skriva, redigera och ta bort meddelanden i gästboken och se bilder från bröllopet. ",
    "details": "Jag är väldigt stolt! Det var en fantastisk upplevelse att skapa hela sajten från grunden och använda alla de färdigheter jag har lärt mig under min första termin på Chas Academy. För första gången skapade jag ett riktigt fullstack-projekt, trots att den är frontend-tung, använder den CRUD-operationer för att kommunicera med databasen och förlitar sig inte bara på LocalStorage. Dessutom använde jag en grupp vänner som en testgrupp för feedback innan jag lanserade den till bröllopets 160 gäster.",
    "link": "https://viktor-emma-08juni2024.netlify.app/",
    "modalTitle": "Wedding Site",
    "gitHubLink": "https://github.com/evesteve94/wedding",
    "alt": "Orange Jellyfish Logo",
    "course": "Bröllopssida",
    "tech": "React, JavaScript, Firebase DB, HTML, CSS",
    "date": "Maj 2024"
  },
  {
    "title": "TaskMaster",
    "image": "./images/taskmaster.png",
    "description": "Task Master är en funktionsspäckad uppgiftshanteringstillämpning byggd med React. Det är mitt första stora React-projekt som implementerar useState, useEffect, useContext och Browser Router för att utveckla en sömlös SPA. Användaren kan skapa sin egen Kanban-tavla och anpassa teman, bakgrundsbilder (genom Unsplash API), sortera och redigera uppgifter - och alla ändringar sparas dynamiskt i localStorage.",
    "details": "Genom att bygga Task Master fick jag insikter i att strukturera storskaliga React-projekt och implementera nyckelfunktioner som uppgiftssortering, redigering och dynamisk datahantering med localStorage. Det här projektet hjälpte mig att förstå vikten av hooks som useState, useEffect, useContext och Browser Router för att hantera tillstånd, hantera sidoeffekter och navigera i en single-page application (SPA). Sammantaget gav Task Master en solid grund i React-utveckling och utrustade mig med praktiska färdigheter som är tillämpliga på framtida projekt.",
    "link": "https://task-master-evesteve.netlify.app/",
    "modalTitle": "Task Master",
    "gitHubLink": "https://github.com/evesteve94/taskmaster-kanban",
    "alt": "Orange Task Master Logo",
    "course": "React",
    "tech": "React, JavaScript, HTML, CSS",
    "date": "April 2024"
  },
  {
    "title": "Dashboard",
    "image": "./images/dashboard.png",
    "description": "En uppgift för min kurs i Avancerad Frontend-utveckling, kodad 100% vanilla. Väderprognoser uppdateras i realtid från OpenWeatherAPI, layouten kan anpassas av användaren med anpassade bakgrunder hämtade från Unsplash API. Titeln, snabblänkarna och anteckningsinnehållet är interaktiva och sparas i webbläsarens localStorage.",
    "details": "Gränssnittet är rent och användarvänligt och erbjuder grundläggande funktioner som tidsbevarande, anteckningstagning och åtkomst till frekvent besökta webbplatser. Med fullständiga skript för varje funktion erbjuder dashboarden en omfattande och anpassningsbar upplevelse för användare att förbättra sin produktivitet och njutning av dagliga uppgifter.",
    "link": "https://dashboard-evesteve-open-access.netlify.app/",
    "modalTitle": "Dashboard",
    "gitHubLink": "https://github.com/evesteve94/dashboard-open-access",
    "alt": "Orange Dashboard Logo",
    "course": "Avancerad Frontend Development",
    "tech": "JavaScript, HTML, CSS",
    "date": "December 2023"
  },
  {
    "title": "TicTacToe",
    "image": "./images/tictactoe.png",
    "description": "En uppgift för min React-kurs, kodad i React och TypeScript för att lära mig hur man typar props, states och funktioner när de passeras genom komponenter. Användaren kan välja mellan tre olika brädor och justera längden på den vinnande kombinationen innan spelet startas.",
    "details": "Tic Tac Toe är en enkel webbapplikation som låter användare spela det klassiska Tic Tac Toe-spelet. Det är byggt med hjälp av React.js, ett populärt JavaScript-bibliotek för att bygga användargränssnitt. Automatisk vinstdetektering: Appen känner automatiskt av när en spelare har vunnit spelet eller om det är oavgjort. Starta om spelet: Spelare kan starta om spelet när som helst för att spela igen.",
    "link": "https://tic-tac-toe-evesteve.netlify.app/",
    "modalTitle": "Tic Tac Toe",
    "gitHubLink": "https://github.com/evesteve94/tic-tac-toe?tab=readme-ov-file",
    "alt": "Orange Tic Tac Toe Logo",
    "course": "React",
    "tech": "React, TypeScript, HTML, CSS",
    "date": "April 2024"
  },
  {
    "title": "Loan Crunch",
    "image": "./images/house.png",
    "description": "Litet projekt kodat 100% vanilla TypeScript. Användaren kan beräkna sitt bolån genom att ange lånebelopp, ränta och låneperiod och sedan visa en betalningsplan månad för månad.",
    "details": "Den här applikationen är en enkel lånekalkylator som gör att användare kan ange lånebelopp, ränta och låneperiod för att uppskatta månatliga betalningar och total ränta. Den validerar inmatningsvärden och ger en detaljerad betalningsplan som visar månadsbetalningsbelopp, betald ränta och återstående saldo under låneperioden. Om inmatningsvärdena överstiger realistiska tröskelvärden visas varningar.",
    "link": "https://morgage-calculator-evesteve.netlify.app/",
    "modalTitle": "Loan Crunch",
    "gitHubLink": "https://github.com/evesteve94/morgage-calculator",
    "alt": "Orange House Logo",
    "course": "TypeScript Intro",
    "tech": "TypeScript, HTML, CSS",
    "date": "Januari 2024"
  },
  {
    "title": "Quire",
    "image": "./images/quire.png",
    "description": "Som en del av en kurs i Agile Working Methods utvecklade mitt team och jag en online-textredigerare. Jag var ansvarig för större delen av funktionaliteten, särskilt funktionen dynamicSave() och uppdateringen av sparade anteckningar till localStorage. Genom det här projektet lärde jag mig att arbeta på distans med en grupp, sammanfoga och lösa konflikter i git och GitHub, och utveckla större program med TypeScript, allt i vanilla!",
    "details": "Med ett användarvänligt gränssnitt erbjuder det ett utbud av funktioner, inklusive en navigeringsfält för snabb åtkomst till väsentliga funktioner som anteckningssökning, visning av alla anteckningar, åtkomst till favoriter och analys. Huvudutmatningsbehållaren visar dynamiskt anteckningar baserat på användarinteraktioner, medan den flytande kontrollmenyn ger bekväma knappar för att skapa nya anteckningar, skriva ut och markera som favoriter. Användare kan skapa anteckningar med titlar och textområden, spara eller ta bort dem efter behov och använda sökfunktionen för att hitta specifika anteckningar. Quire integrerar också Google Analytics för att spåra webbplatsanvändning. ",
    "link": "https://quireteammalmo.netlify.app/",
    "modalTitle": "Quire",
    "gitHubLink": "https://github.com/carstern/quireproject",
    "alt": "Orange Notebook Logo",
    "course": "Avancerad Frontend Development",
    "tech": "TypeScript, HTML, CSS",
    "date": "Februari 2024"
  },
  {
    "title": "Memory",
    "image": "./images/brain.png",
    "description": "Detta är ett projekt för Code Jam för Chas Academys Fullstack Java Extended-klass '23. Spelet är utvecklat i 100% html, css och js vanilla och har fyra olika svårighetsnivåer. Det är superdumt. Kolla in det!",
    "details": "Den har en dynamiskt layout av kort med dolda symboler som spelarna måste matcha genom att välja par. Spelet spårar antalet försök som gjorts och utmanar spelarna att slutföra spelet med så få försök som möjligt. Det inkluderar återkopplingsmeddelanden som indikerar om de valda korten matchar eller inte. En omstartsknapp låter spelarna återställa spelet och prova olika strategier. Med ett engagerande gränssnitt och slumpmässiga kortlayouter kan spelare njuta av en underhållande och stimulerande upplevelse samtidigt som de slipar sina minne och koncentration. ",
    "link": "https://emojory-evesteve.netlify.app/",
    "modalTitle": "Memory",
    "gitHubLink": "https://github.com/evesteve94/Memory-Expanded.git",
    "alt": "Orange Brain Logo",
    "course": "Webbutveckling",
    "tech": "JavaScript, HTML, CSS",
    "date": "Oktober 2023"
  },
  {
    "title": "Old CV",
    "image": "./images/cv.png",
    "description": "Detta är mitt gamla CV som jag utvecklade 100% i vanilla JS. Det du läser nu är ett exempel på hur mycket jag har lärt mig på bara två korta månader. Klicka på länken och jämför!",
    "details": "Dess funktioner inkluderar en responsiv design optimerad för olika enheter, enkel navigering med rullgardinsmeny och traditionella navigeringslänkar, en profilsektion som introducerar mig själv, en projektsektion som visar mitt arbete med interaktiva modalpopuppar som ger projektdetaljer, och länkar till sociala medier i sidfoten för ytterligare engagemang. ",
    "link": "https://evabjorling-cv.netlify.app/",
    "modalTitle": "Old CV",
    "gitHubLink": "https://github.com/evesteve94/evesteve_cv",
    "alt": "Orange Briefcase Logo",
    "course": "Webbutveckling",
    "tech": "JavaScript, HTML, CSS",
    "date": "Oktober 2023"
  },
  {
    "title": "To Do List",
    "image": "./images/todo.png",
    "description": "Detta är min allra första app kodad i React! Det är en enkel att göra-lista som består av några komponenter som använder localStorage och useState. Funktioner inkluderar: lägg till, sök, markera av och ta bort.",
    "details": "Det här projektet var en utmärkt introduktion till Reacts sätt att tänka, med fokus på att bygga återanvändbara komponenter och utforma användarvänliga gränssnitt för single-page applications. Det gav värdefulla praktiska erfarenheter med Reacts ekosystem och lärde mig hur man strukturerar applikationer annorlunda och betonade vikten av modulär, underhållbar kod. Sammantaget var det en praktisk resa in i React-utveckling, som erbjöd insikter som direkt kan tillämpas på verkliga projekt och hjälpte mig att förstå kärnkoncepten bakom Reacts tillvägagångssätt för att bygga moderna webbapplikationer. ",
    "link": "https://todo-list-evesteve.netlify.app/",
    "modalTitle": "To Do List",
    "gitHubLink": "https://github.com/evesteve94/todo-list",
    "alt": "Orange Checked Logo",
    "course": "React",
    "tech": "React, JavaScript, HTML, CSS",
    "date": "Mars 2024"
  },
  {
    "title": "Mermaid",
    "image": "./images/club.png",
    "description": "Det här är ett sidoprojekt för min favoritlokal dragklubb. Den är baserad på deras egna webbplats, men förbättrad med mer utförlig information, bilder och responsivitet. Jämför med originalet: https://clubmermaid.se/",
    "details": "Det här projektet för min lokala dragklubb förbättrade mina frontend-färdigheter genom att replikera deras webbplats med dynamiskt innehåll som laddas från JSON-filer. Genom att implementera modaler för information om artister förbättrades användarupplevelsen, medan hanteringen av händelser fördjupade min förståelse för DOM-manipulering. Principer för responsiv design säkerställde webbplatsens användbarhet över olika enheter. Lärdomar inkluderar effektiv datahantering, interaktivitet och optimering för olika skärmstorlekar, vilket bidrar till en mer engagerande webbplats för Club Mermaid och slipar mina färdigheter som utvecklare.",
    "link": "https://club-mermaid-evesteve.netlify.app/",
    "modalTitle": "Club Mermaid",
    "gitHubLink": "https://github.com/evesteve94/club-mermaid-project.git",
    "alt": "Orange Mermaid Logo",
    "course": "Sidoprojekt",
    "tech": "JavaScript, HTML, CSS",
    "date": "Oktober 2023"
  }
]
