[
    {
        "title": "Wedding Site",
        "image": "./images/jellyfish.png",
        "description": "This website is by far my favourite side project to date. It is a wedding gift for my brother, implementing his to-be-wife's illustrations. It is my biggest React project, with pleanty of custom-made components and seemless dropdown menus. Additionally, I have implemented login, authenication and a database through Firebase db. Users can log in, write, edit and delete messages in the guest book and view pictures from the wedding. ",
        "details":"This is my pride and joy! It was a fantastic experince to create the entire site from scratch and using all the skills I have learned during my first term at Chas Academy. For the first time I created a real fullstack project, though frontend-heavy, it uses CRUD-operations to communicate with the database and doesn't only rely on LocalStorage. Additionally, I used a group of friends as a test group for feedback before launching it to the weddings 160 guests.",
        "link": "https://viktor-emma-08juni2024.netlify.app/",
        "modalTitle": "Wedding Site",
        "gitHubLink": "https://github.com/evesteve94/wedding",
        "alt": "Orange Jellyfish Logo",
        "course": "Side Project",
        "tech" : "React, JavaScript, Firebase DB, HTML, CSS"
    }, 
    {
        "title": "TaskMaster",
        "image": "./images/taskmaster.png",
        "description": "Task Master is a feature-rich task management application built with React. It is my first large React-project, implementing useState, useEffect, useContext and Browser Router to develope a seemless SPA. The user can create their own Kanban board and customize themes, background images (through Unsplash API), sort and edit tasks - saving all changes dynamically in localStorage.",
        "details":"Through building Task Master, I gained insights into structuring large-scale React projects and implementing key features like task sorting, editing, and dynamic data storage using localStorage. This project helped me understand the importance of hooks like useState, useEffect, useContext, and Browser Router in managing state, handling side effects, and navigating in a single-page application (SPA). Overall, Task Master provided a solid foundation in React development and equipped me with practical skills applicable to future projects.",
        "link": "https://task-master-evesteve.netlify.app/",
        "modalTitle": "Task Master",
        "gitHubLink": "https://github.com/evesteve94/taskmaster-kanban",
        "alt": "Orange Task Master Logo",
        "course": "React",
        "tech" : "React, JavaScript, HTML, CSS"
    }, 
    {
        "title": "Dashboard",
        "image": "./images/dashboard.png",
        "description": "An assignment for my Advanced Frontend Dev course, coded 100% vanilla. Weather forecasts are updated in realtime from OpenWeatherAPI, the layout is editable by the user with custom backgrounds fetched from an Unplash API. The title, quick links and notepad content are interactive and saved to the browsers localStorage.",
        "details": "The interface is clean and user-friendly, providing essential functionalities like timekeeping, note-taking, and access to frequently visited websites. With completed scripts handling each feature, the dashboard offers a comprehensive and customizable experience for users to enhance their productivity and enjoyment of daily tasks.",
        "link": "https://dashboard-evesteve-open-access.netlify.app/",
        "modalTitle": "Dashboard",
        "gitHubLink": "https://github.com/evesteve94/dashboard-open-access",
        "alt": "Orange Dashboard Logo",
        "course": "Advanced Frontend Development",
        "tech" : "JavaScript, HTML, CSS"
    },     
    {
        "title": "TicTacToe",
        "image": "./images/tictactoe.png",
        "description": "An assignment for my React course, coded in React and TypeScript to learn how to type props, states and functions when passed through components. The User can choose between three different boards and adjust the length of the winning combonation before starting the game.",
        "details": "Tic Tac Toe is a simple web application that allows users to play the classic Tic Tac Toe game. It's built using React.js, a popular JavaScript library for building user interfaces. Automatic Win Detection: The app automatically detects when a player has won the game or if it's a draw. Restart Game: Players can restart the game at any time to play again.",
        "link": "https://tic-tac-toe-evesteve.netlify.app/",
        "modalTitle": "Tic Tac Toe",
        "gitHubLink": "https://github.com/evesteve94/tic-tac-toe?tab=readme-ov-file",
        "alt": "Orange Tic Tac Toe Logo",
        "course": "React",
        "tech" : "React, TypeScript, HTML, CSS"
    },   
    {
        "title": "Loan Crunch",
        "image": "./images/house.png",
        "description": "Small project coded 100% vanilla TypeScript. The user can calculate their morgage by entering loan amount, interest rate and loan period and then view a payment plan month-by-month.",
        "details": "This application is a straightforward loan calculator allowing users to input the loan amount, interest rate, and loan period to estimate monthly payments and total interest. It validates input values and provides a detailed payment plan showing monthly payment amounts, interest paid, and remaining balance over the loan term. If input values exceed realistic thresholds, it displays warnings.",
        "link": "https://morgage-calculator-evesteve.netlify.app/",
        "modalTitle": "Loan Crunch",
        "gitHubLink": "https://github.com/evesteve94/morgage-calculator",
        "alt": "Orange House Logo",
        "course": "TypeScript Intro",
        "tech" : "TypeScript, HTML, CSS"
    },
    {
        "title": "Quire",
        "image": "./images/quire.png",
        "description": "As part of an Agile Working Methods course, my team and I developed an online text editor. I was responisible for most of the functionality, particulary the dynamicSave() function and updating the saved notes to localStorage. Through this project I learned how to work remotely with a group, merge and solve conflicts in git and GitHub, and develope larger programs with TypeScript, all in vanilla!",
        "details" : "With a user-friendly interface, it offers a range of functionalities, including a navigation bar for quick access to essential features like note search, viewing all notes, accessing favorites, and analytics. The main output container dynamically displays notes based on user interactions, while the floating control menu provides convenient buttons for creating new notes, printing, and marking as favorites. Users can create notes with titles and text areas, save or delete them as needed, and utilize the search function to find specific notes. Quire also integrates Google Analytics for tracking website usage. ",
        "link": "https://quireteammalmo.netlify.app/",
        "modalTitle": "Quire",
        "gitHubLink": "https://github.com/carstern/quireproject",
        "alt": "Orange Notebook Logo",
        "course": "Advanced Frontend Development",
        "tech" : "TypeScript, HTML, CSS"
    },    
    {
        "title": "Memory",
        "image": "./images/brain.png",
        "description": "This is a project for Code Jam for Chas Academy's Fullstack Java Extended class of '23. The game is developed in 100% html, css and js vanilla and has four different modes of difficulty. It's super dumb. Check it out!",
        "details": "It features a dynamic card layout with hidden symbols that players must match by selecting pairs. The game tracks the number of attempts made, challenging players to complete the game with as few tries as possible. It includes feedback messages indicating whether the selected cards match or not. A restart button allows players to reset the game and try different strategies. With an engaging interface and randomized card layouts, players can enjoy an entertaining and stimulating experience while honing their memory and concentration skills.",
        "link": "https://emojory-evesteve.netlify.app/",
        "modalTitle": "Memory",
        "gitHubLink": "https://github.com/evesteve94/Memory-Expanded.git",
        "alt": "Orange Brain Logo",
        "course": "Web development",
        "tech" : "JavaScript, HTML, CSS"
    }, 
    {
        "title": "Old CV",
        "image": "./images/cv.png",
        "description": "This is my old CV that i developed 100% in vanilla JS. The one you are currently reading now is an example of how much I've learned in just two short months. Click the link and compare!",
        "details": "Its features include a responsive design optimized for various devices, easy navigation with dropdown menu and traditional nav links, a profile section introducing myself, a projects section showcasing her work with interactive modal pop-ups providing project details, and social media links in the footer for further engagement. ",
        "link": "https://evabjorling-cv.netlify.app/",
        "modalTitle": "Old CV",
        "gitHubLink": "https://github.com/evesteve94/evesteve_cv",
        "alt": "Orange Briefcase Logo",
        "course": "Web development",
        "tech" : "JavaScript, HTML, CSS"
    },
    {
        "title": "To Do List",
        "image": "./images/todo.png",
        "description": "This is my very first app coded in React! It is a simple to do list consisting of a few components that uses localStorage and useState. Functionalities include: add, search, check off and delete.",
        "details": "This project was an excellent introduction to React's way of thinking, focusing heavily on building reusable components and designing user-friendly interfaces for single-page applications. It provided valuable hands-on experience with React's ecosystem, teaching me how to structure applications differently and emphasizing the importance of modular, maintainable code. Overall, it was a practical journey into React development, offering insights that can be directly applied to real-world projects, and helping me grasp the core concepts behind React's approach to building modern web applications. ",
        "link": "https://todo-list-evesteve.netlify.app/",
        "modalTitle": "To Do List",
        "gitHubLink": "https://github.com/evesteve94/todo-list",
        "alt": "Orange Checked Logo",
        "course": "React",
        "tech" : "React, JavaScript, HTML, CSS"
    },
    {
        "title": "Mermaid",
        "image": "./images/club.png",
        "description": "This a side project for my favourite local drag club. It is based on their own website, but improved with more eloborate information, images and responsitivity. Compare with the original: https://clubmermaid.se/",
        "details" :"This project for my local drag club enhanced my frontend skills by replicating their website with dynamic content loading from JSON files. Implementing modals for performer details improved user experience, while event handling deepened my understanding of DOM manipulation. Responsive design principles ensured the site's usability across devices. Lessons learned include efficient data management, interactivity, and optimizing for diverse screen sizes, contributing to a more engaging website for Club Mermaid and honing my skills as a developer.",
        "link": "https://club-mermaid-evesteve.netlify.app/",
        "modalTitle": "Club Mermaid",
        "gitHubLink": "https://github.com/evesteve94/club-mermaid-project.git",
        "alt": "Orange Mermaid Logo",
        "course": "Side Project",
        "tech" : "JavaScript, HTML, CSS"
    }
]